Spot.create!(
  [
    {
      name: '皇居東御苑 二の丸庭園'
    },
    {
      name: '旧済生館本館（山形市郷土館）庭園'
    },
    {
      name: '玉泉院丸庭園（金沢城公園）'
    },
    {
      name: '浜松城公園 日本庭園'
    },
    {
      name: '清爽園'
    },
    {
      name: '上杉神社庭園（米沢城跡）'
    },
    {
      name: '楽々園（玄宮楽々園）'
    },
    {
      name: '玄宮園（玄宮楽々園）'
    },
    {
      name: '川越城本丸御殿庭園'
    },
    {
      name: '兼六園'
    },
    {
      name: '後楽園'
    },
    {
      name: '偕楽園'
    },
    {
      name: '毛越寺 '
    },
    {
      name: '旧観自在王院庭園 '
    },
    {
      name: '光前寺 '
    },
    {
      name: '一乗谷朝倉氏庭園'
    },
    {
      name: '西芳寺（苔寺）'
    },
    {
      name: '龍安寺 方丈石庭 '
    },
    {
      name: '恵林寺 国指定名勝庭園'
    },
    {
      name: '妙心寺 退蔵院 （'
    },
    {
      name: '天龍寺 曹源池庭園 '
    },
    {
      name: '大徳寺 大仙院 '
    },
    {
      name: '鹿苑寺 （金閣寺）'
    },
    {
      name: '大徳寺 龍源院方丈庭園 '
    },
    {
      name: '慈照寺 （銀閣寺）'
    },
    {
      name: '高台寺 圓徳院 '
    },
    {
      name: '本法寺 巴の庭'
    },
    {
      name: '旧大乗院庭園'
    },
    {
      name: '旧大乗院庭園'
    },
    {
      name: '太山寺 安養院庭園 '
    },
    {
      name: '粉河寺 庭園 '
    },
    {
      name: '竹林寺 庭園 '
    },
    {
      name: '養浩館庭園'
    },
    {
      name: '西福寺 庭園'
    },
    {
      name: '青岸寺 庭園'
    },
    {
      name: '大通寺 含山軒庭園、蘭亭庭園'
    },
    {
      name: '二条城 二の丸御殿庭園 '
    },
    {
      name: '居初氏庭園'
    },
    {
      name: '桂離宮 '
    },
    {
      name: '修学院離宮 '
    },
    {
      name: '醍醐寺 三宝院 '
    },
    {
      name: '西本願寺 書院 '
    },
    {
      name: '南禅寺 方丈'
    },
    {
      name: '南禅寺 金地院'
    },
    {
      name: '大徳寺 方丈'
    },
    {
      name: '詩仙堂 '
    },
    {
      name: '円通寺 '
    },
    {
      name: '松花堂 庭園'
    },
    {
      name: '根来寺 庭園'
    },
    {
      name: '和歌山城西之丸庭園（紅葉渓庭園） '
    },
    {
      name: '養翠園'
    },
    {
      name: '観音院 庭園 '
    },
    {
      name: '徳島城 旧徳島城表御殿庭園 （千秋閣庭園）'
    },
    {
      name: '慶雲館庭園 '
    },
    {
      name: '円山公園'
    },
    {
      name: '無鄰庵 '
    },
    {
      name: '平安神宮神苑 '
    },
    {
      name: '碧雲荘 '
    },
    {
      name: '楽々荘庭園 '
    },
    {
      name: '慶沢園 '
    },
    {
      name: '相楽園'
    },
    {
      name: '依水園 '
    },
    {
      name: '温山荘園 '
    },
    {
      name: '揚亀園'
    },
    {
      name: '三溪園'
    },
    {
      name: '盛美園'
    },
    {
      name: '香雪園'
    },
    {
      name: '東福寺方丈庭園'
    }
  ]
)
